--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\USUARIO\Desktop\Summer school\Trabajos\Replication\raw\rep
> lication_hla_base_tables.log
  log type:  text
 opened on:  24 Jun 2020, 01:17:27

. 
. #for this code to work it is necessary to declare the directory of the compute
> r where the database is located
Unknown #command

. cd "C:\Users\USUARIO\Desktop\Summer school\Trabajos\Replication\raw" 
C:\Users\USUARIO\Desktop\Summer school\Trabajos\Replication\raw

. 
. use "hla_country_web.dta", clear

. 
. local cont "europe africa asia americas"

. local base "ln_le60!=. & ln_hla_het!=. & ln_frac!=. & ln_abslat!=. & ln_arable
> !=. & ln_suitavg!=. & aa_ln_atd!=."

. local bc "ln_frac aa_ln_atd ln_arable ln_suitavg ln_abslat"

. qui log off
graph twoway (scatter ln_hla_het aa_mdist if europe==1) (scatter ln_hla_het aa_m
> dist if africa==1, msymbol(oh)) (scatter ln_hla_het aa_mdist if asia==1, msymb
> ol(S)) (scatter ln_hla_het aa_mdist if americas==1, msymbol(T)) (scatter ln_hl
> a_het aa_mdist if oceania==1, msymbol(Th)) || (lfit ln_hla_het aa_mdist) , leg
> end(label(1 European) label(2 African)label(3 Asia)  label(4 American) label(5
>  "Oceanianic/ No Majority")) graphregion(color(white)) bgcolor(white) xtitle("
> Migratory Distance from East Africa (Ancestry Adjusted)") ytitle("In HLA Heter
> ozygosity") ysc(r(-1.5 -1)) ylabel(-1.5(0.1)-1)

. qui log off
reg ln_hla_het aa_ln_atd if aa_mdist!=. & `base' & ln_le60!=., rob

Linear regression                               Number of obs     =        131
                                                F(1, 129)         =       4.65
                                                Prob > F          =     0.0329
                                                R-squared         =     0.0217
                                                Root MSE          =     .06738

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   aa_ln_atd |   .0211444   .0098049     2.16   0.033     .0017451    .0405438
       _cons |  -1.326062    .084678   -15.66   0.000      -1.4936   -1.158525
------------------------------------------------------------------------------

. 
. reg ln_hla_het aa_ln_atd aa_mdist if aa_mdist!=. & ln_le60!=. & `base', rob

Linear regression                               Number of obs     =        131
                                                F(2, 128)         =      37.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4265
                                                Root MSE          =     .05179

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   aa_ln_atd |   .0299843   .0086383     3.47   0.001     .0128921    .0470766
    aa_mdist |  -.0120634   .0014224    -8.48   0.000    -.0148779    -.009249
       _cons |  -1.321902   .0729942   -18.11   0.000    -1.466333    -1.17747
------------------------------------------------------------------------------

. 
. reg ln_hla_het aa_lanim if aa_mdist!=. & `base' & ln_le60!=., rob

Linear regression                               Number of obs     =         89
                                                F(1, 87)          =      17.05
                                                Prob > F          =     0.0001
                                                R-squared         =     0.1176
                                                Root MSE          =     .07228

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    aa_lanim |   .0266128   .0064443     4.13   0.000     .0138042    .0394215
       _cons |  -1.189394   .0126485   -94.03   0.000    -1.214534   -1.164254
------------------------------------------------------------------------------

. 
. reg ln_hla_het aa_lanim aa_mdist if aa_mdist!=. & `base' & ln_le60!=., rob

Linear regression                               Number of obs     =         89
                                                F(2, 86)          =      52.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5968
                                                Root MSE          =     .04914

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    aa_lanim |   .0360532   .0050961     7.07   0.000     .0259225     .046184
    aa_mdist |   -.013321   .0014938    -8.92   0.000    -.0162905   -.0103515
       _cons |  -1.109316   .0107794  -102.91   0.000    -1.130745   -1.087888
------------------------------------------------------------------------------

. 
. reg ln_hla_het aa_lpd1 if aa_mdist!=. & `base' & ln_le60!=., rob

Linear regression                               Number of obs     =        113
                                                F(1, 111)         =      11.23
                                                Prob > F          =     0.0011
                                                R-squared         =     0.0626
                                                Root MSE          =     .06849

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     aa_lpd1 |    .014363   .0042865     3.35   0.001     .0058691    .0228569
       _cons |  -1.154714   .0074313  -155.39   0.000     -1.16944   -1.139989
------------------------------------------------------------------------------

. 
. reg ln_hla_het aa_lpd1 aa_mdist if aa_mdist!=. & `base' & ln_le60!=., rob

Linear regression                               Number of obs     =        113
                                                F(2, 110)         =      37.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4578
                                                Root MSE          =     .05233

------------------------------------------------------------------------------
             |               Robust
  ln_hla_het |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     aa_lpd1 |   .0158342   .0032576     4.86   0.000     .0093785    .0222899
    aa_mdist |  -.0123827   .0015009    -8.25   0.000    -.0153571   -.0094084
       _cons |  -1.072103   .0100197  -107.00   0.000     -1.09196   -1.052247
------------------------------------------------------------------------------

. qui log off
reg ln_mort40 ln_hla_het if `base', rob

Linear regression                               Number of obs     =         73
                                                F(1, 71)          =      49.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3488
                                                Root MSE          =     .49154

------------------------------------------------------------------------------
             |               Robust
   ln_mort40 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |  -5.007995    .711708    -7.04   0.000    -6.427101    -3.58889
       _cons |  -6.672417   .8309391    -8.03   0.000    -8.329263   -5.015572
------------------------------------------------------------------------------

. 
. reg ln_mort40 ln_hla_het `bc' `cont' if `base', rob

Linear regression                               Number of obs     =         73
                                                F(10, 62)         =      15.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5133
                                                Root MSE          =     .45476

------------------------------------------------------------------------------
             |               Robust
   ln_mort40 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |  -3.861032   1.128212    -3.42   0.001    -6.116297   -1.605768
     ln_frac |  -.3970101   .3960854    -1.00   0.320    -1.188773    .3947533
   aa_ln_atd |   .5975243   .2358444     2.53   0.014     .1260782    1.068971
   ln_arable |   .0448605   .1220245     0.37   0.714    -.1990631    .2887841
  ln_suitavg |   .0361975   .0844383     0.43   0.670    -.1325923    .2049874
   ln_abslat |  -.3260423   .1296545    -2.51   0.015     -.585218   -.0668665
      europe |   .1074832   .1696108     0.63   0.529    -.2315639    .4465303
      africa |   .4589723   .2152117     2.13   0.037     .0287701    .8891744
        asia |   .1722149   .2033102     0.85   0.400    -.2341963    .5786261
    americas |   .1102584   .1877282     0.59   0.559     -.265005    .4855218
       _cons |  -9.575309   2.730034    -3.51   0.001    -15.03257    -4.11805
------------------------------------------------------------------------------

. 
. reg ln_le40 ln_hla_het if `base', rob

Linear regression                               Number of obs     =         71
                                                F(1, 69)          =      41.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3329
                                                Root MSE          =     .21596

------------------------------------------------------------------------------
             |               Robust
     ln_le40 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   2.143586   .3309808     6.48   0.000     1.483298    2.803875
       _cons |    6.25536   .3783145    16.53   0.000     5.500643    7.010076
------------------------------------------------------------------------------

. 
. reg ln_le40 ln_hla_het `bc' `cont' if `base', rob

Linear regression                               Number of obs     =         71
                                                F(10, 60)         =      44.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7192
                                                Root MSE          =     .15026

------------------------------------------------------------------------------
             |               Robust
     ln_le40 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   1.077113   .3770962     2.86   0.006      .322808    1.831418
     ln_frac |    .072362    .133847     0.54   0.591    -.1953719    .3400959
   aa_ln_atd |  -.0030757   .0549058    -0.06   0.956    -.1129035    .1067522
   ln_arable |  -.1059797   .0365892    -2.90   0.005     -.179169   -.0327905
  ln_suitavg |   .0529932   .0238341     2.22   0.030     .0053179    .1006686
   ln_abslat |    .098031   .0409504     2.39   0.020     .0161181    .1799439
      europe |   -.052723   .0434553    -1.21   0.230    -.1396465    .0342005
      africa |  -.5020729   .0592995    -8.47   0.000    -.6206896   -.3834562
        asia |  -.3398571   .0565811    -6.01   0.000    -.4530363    -.226678
    americas |  -.3291928   .0621135    -5.30   0.000    -.4534382   -.2049474
       _cons |   5.316719   .5542282     9.59   0.000     4.208097     6.42534
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het if `base', rob

Linear regression                               Number of obs     =        131
                                                F(1, 129)         =      43.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2271
                                                Root MSE          =     .20359

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   1.620043   .2454809     6.60   0.000     1.134353    2.105733
       _cons |   5.814552   .2829132    20.55   0.000     5.254801    6.374303
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =     100.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7446
                                                Root MSE          =     .12133

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.01512   .1899264     5.34   0.000     .6390794    1.391161
     ln_frac |  -.1210012   .0927409    -1.30   0.194    -.3046217    .0626193
   aa_ln_atd |   .0369984   .0397486     0.93   0.354    -.0417011    .1156979
   ln_arable |  -.0086997   .0159756    -0.54   0.587    -.0403303    .0229309
  ln_suitavg |    .008039   .0128307     0.63   0.532     -.017365    .0334429
   ln_abslat |   .0199086   .0156461     1.27   0.206    -.0110696    .0508867
      europe |   .0387395   .0716524     0.54   0.590    -.1031272    .1806062
      africa |  -.3122101   .0754901    -4.14   0.000    -.4616753    -.162745
        asia |  -.2056222   .0755278    -2.72   0.007     -.355162   -.0560825
    americas |  -.0400593   .0736294    -0.54   0.587    -.1858403    .1057217
       _cons |   4.962063   .4156831    11.94   0.000     4.139039    5.785086
------------------------------------------------------------------------------

. qui log off
local le "ln_le60!=. & ln_le70!=. & ln_le80!=. & ln_le90!=. & ln_le00!=. & ln_le
> 10!=."

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =     100.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7446
                                                Root MSE          =     .12133

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.01512   .1899264     5.34   0.000     .6390794    1.391161
     ln_frac |  -.1210012   .0927409    -1.30   0.194    -.3046217    .0626193
   aa_ln_atd |   .0369984   .0397486     0.93   0.354    -.0417011    .1156979
   ln_arable |  -.0086997   .0159756    -0.54   0.587    -.0403303    .0229309
  ln_suitavg |    .008039   .0128307     0.63   0.532     -.017365    .0334429
   ln_abslat |   .0199086   .0156461     1.27   0.206    -.0110696    .0508867
      europe |   .0387395   .0716524     0.54   0.590    -.1031272    .1806062
      africa |  -.3122101   .0754901    -4.14   0.000    -.4616753    -.162745
        asia |  -.2056222   .0755278    -2.72   0.007     -.355162   -.0560825
    americas |  -.0400593   .0736294    -0.54   0.587    -.1858403    .1057217
       _cons |   4.962063   .4156831    11.94   0.000     4.139039    5.785086
------------------------------------------------------------------------------

. 
. reg ln_le70 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      76.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7340
                                                Root MSE          =     .11485

------------------------------------------------------------------------------
             |               Robust
     ln_le70 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.04047   .1695943     6.14   0.000     .7046852    1.376255
     ln_frac |  -.1163928   .0881347    -1.32   0.189    -.2908934    .0581078
   aa_ln_atd |   .0246249   .0372331     0.66   0.510    -.0490941     .098344
   ln_arable |  -.0141638   .0153671    -0.92   0.359    -.0445896    .0162619
  ln_suitavg |   .0007926   .0135757     0.06   0.954    -.0260864    .0276715
   ln_abslat |   .0045722   .0158262     0.29   0.773    -.0267626    .0359069
      europe |   .0344497   .0460362     0.75   0.456    -.0566989    .1255982
      africa |  -.3192781   .0522129    -6.11   0.000    -.4226561   -.2159002
        asia |  -.1420921   .0484679    -2.93   0.004    -.2380552    -.046129
    americas |  -.0238244   .0420173    -0.57   0.572    -.1070157    .0593668
       _cons |   5.198611   .3846817    13.51   0.000     4.436968    5.960254
------------------------------------------------------------------------------

. 
. reg ln_le80 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      55.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6995
                                                Root MSE          =     .10588

------------------------------------------------------------------------------
             |               Robust
     ln_le80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8420929    .169953     4.95   0.000     .5055977    1.178588
     ln_frac |  -.1462667   .0786894    -1.86   0.066    -.3020663    .0095329
   aa_ln_atd |   .0348747   .0381473     0.91   0.362    -.0406544    .1104037
   ln_arable |  -.0199753   .0150991    -1.32   0.188    -.0498705    .0099199
  ln_suitavg |   .0003745   .0142482     0.03   0.979    -.0278359    .0285849
   ln_abslat |   .0070102   .0152294     0.46   0.646    -.0231431    .0371634
      europe |   .0176881   .0373365     0.47   0.637    -.0562357    .0916118
      africa |  -.2552229   .0450962    -5.66   0.000    -.3445103   -.1659355
        asia |  -.1194574   .0422942    -2.82   0.006     -.203197   -.0357178
    americas |  -.0064243   .0328959    -0.20   0.845    -.0715559    .0587073
       _cons |   4.945296   .3733601    13.25   0.000     4.206069    5.684523
------------------------------------------------------------------------------

. 
. reg ln_le90 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      32.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6886
                                                Root MSE          =     .10684

------------------------------------------------------------------------------
             |               Robust
     ln_le90 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .5490235   .1798274     3.05   0.003     .1929779    .9050692
     ln_frac |   -.183742   .0828562    -2.22   0.028    -.3477915   -.0196925
   aa_ln_atd |   .0383219    .035843     1.07   0.287    -.0326448    .1092886
   ln_arable |  -.0220742   .0174598    -1.26   0.209    -.0566434    .0124949
  ln_suitavg |  -.0046492   .0148575    -0.31   0.755     -.034066    .0247677
   ln_abslat |   .0247666   .0225831     1.10   0.275    -.0199464    .0694797
      europe |   .0189598   .0440979     0.43   0.668    -.0683511    .1062706
      africa |  -.2203019   .0524047    -4.20   0.000    -.3240596   -.1165442
        asia |  -.0726899   .0444554    -1.64   0.105    -.1607085    .0153287
    americas |   .0346061   .0405436     0.85   0.395    -.0456675    .1148796
       _cons |   4.554555   .4118077    11.06   0.000     3.739204    5.369906
------------------------------------------------------------------------------

. 
. reg ln_le00 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7683
                                                Root MSE          =     .09193

------------------------------------------------------------------------------
             |               Robust
     ln_le00 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .2512166   .1540813     1.63   0.106    -.0538535    .5562868
     ln_frac |  -.1775283   .0728385    -2.44   0.016    -.3217434   -.0333131
   aa_ln_atd |   .0843881   .0303567     2.78   0.006      .024284    .1444923
   ln_arable |  -.0062233   .0115616    -0.54   0.591    -.0291145    .0166679
  ln_suitavg |  -.0168243   .0100998    -1.67   0.098    -.0368211    .0031725
   ln_abslat |   .0137408   .0156327     0.88   0.381    -.0172109    .0446925
      europe |  -.0010578   .0524527    -0.02   0.984    -.1049104    .1027948
      africa |  -.2497432   .0608725    -4.10   0.000    -.3702665   -.1292199
        asia |  -.0924549    .052818    -1.75   0.083     -.197031    .0121211
    americas |   .0264391   .0515306     0.51   0.609    -.0755879     .128466
       _cons |    3.85075    .309451    12.44   0.000     3.238059    4.463442
------------------------------------------------------------------------------

. 
. reg ln_le10 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7480
                                                Root MSE          =     .08408

------------------------------------------------------------------------------
             |               Robust
     ln_le10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .1787627   .1334796     1.34   0.183    -.0855176     .443043
     ln_frac |  -.1508934   .0700744    -2.15   0.033    -.2896359   -.0121509
   aa_ln_atd |      .0733   .0301988     2.43   0.017     .0135085    .1330916
   ln_arable |  -.0045715   .0094332    -0.48   0.629    -.0232486    .0141057
  ln_suitavg |  -.0138008   .0083383    -1.66   0.101    -.0303101    .0027084
   ln_abslat |   .0066167   .0136851     0.48   0.630    -.0204788    .0337121
      europe |   .0065547   .0508292     0.13   0.898    -.0940836     .107193
      africa |  -.2235135   .0590873    -3.78   0.000    -.3405023   -.1065247
        asia |  -.0839933   .0521013    -1.61   0.110    -.1871502    .0191637
    americas |   .0163142   .0512064     0.32   0.751    -.0850709    .1176994
       _cons |   3.912044    .282363    13.85   0.000     3.352985    4.471104
------------------------------------------------------------------------------

. qui log off
local le "ln_le60!=. & ln_le70!=. & ln_le80!=. & ln_le90!=. & ln_le00!=. & ln_le
> 10!=."

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `le', rob 

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =     100.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7446
                                                Root MSE          =     .12133

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.01512   .1899264     5.34   0.000     .6390794    1.391161
     ln_frac |  -.1210012   .0927409    -1.30   0.194    -.3046217    .0626193
   aa_ln_atd |   .0369984   .0397486     0.93   0.354    -.0417011    .1156979
   ln_arable |  -.0086997   .0159756    -0.54   0.587    -.0403303    .0229309
  ln_suitavg |    .008039   .0128307     0.63   0.532     -.017365    .0334429
   ln_abslat |   .0199086   .0156461     1.27   0.206    -.0110696    .0508867
      europe |   .0387395   .0716524     0.54   0.590    -.1031272    .1806062
      africa |  -.3122101   .0754901    -4.14   0.000    -.4616753    -.162745
        asia |  -.2056222   .0755278    -2.72   0.007     -.355162   -.0560825
    americas |  -.0400593   .0736294    -0.54   0.587    -.1858403    .1057217
       _cons |   4.962063   .4156831    11.94   0.000     4.139039    5.785086
------------------------------------------------------------------------------

. estimates store y1960

. local coef1960=_b[ln_hla_het]

. local lb1960 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1960 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le70 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      76.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7340
                                                Root MSE          =     .11485

------------------------------------------------------------------------------
             |               Robust
     ln_le70 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.04047   .1695943     6.14   0.000     .7046852    1.376255
     ln_frac |  -.1163928   .0881347    -1.32   0.189    -.2908934    .0581078
   aa_ln_atd |   .0246249   .0372331     0.66   0.510    -.0490941     .098344
   ln_arable |  -.0141638   .0153671    -0.92   0.359    -.0445896    .0162619
  ln_suitavg |   .0007926   .0135757     0.06   0.954    -.0260864    .0276715
   ln_abslat |   .0045722   .0158262     0.29   0.773    -.0267626    .0359069
      europe |   .0344497   .0460362     0.75   0.456    -.0566989    .1255982
      africa |  -.3192781   .0522129    -6.11   0.000    -.4226561   -.2159002
        asia |  -.1420921   .0484679    -2.93   0.004    -.2380552    -.046129
    americas |  -.0238244   .0420173    -0.57   0.572    -.1070157    .0593668
       _cons |   5.198611   .3846817    13.51   0.000     4.436968    5.960254
------------------------------------------------------------------------------

. estimates store y1970

. local coef1970=_b[ln_hla_het]

. local lb1970 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1970 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le80 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      55.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6995
                                                Root MSE          =     .10588

------------------------------------------------------------------------------
             |               Robust
     ln_le80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8420929    .169953     4.95   0.000     .5055977    1.178588
     ln_frac |  -.1462667   .0786894    -1.86   0.066    -.3020663    .0095329
   aa_ln_atd |   .0348747   .0381473     0.91   0.362    -.0406544    .1104037
   ln_arable |  -.0199753   .0150991    -1.32   0.188    -.0498705    .0099199
  ln_suitavg |   .0003745   .0142482     0.03   0.979    -.0278359    .0285849
   ln_abslat |   .0070102   .0152294     0.46   0.646    -.0231431    .0371634
      europe |   .0176881   .0373365     0.47   0.637    -.0562357    .0916118
      africa |  -.2552229   .0450962    -5.66   0.000    -.3445103   -.1659355
        asia |  -.1194574   .0422942    -2.82   0.006     -.203197   -.0357178
    americas |  -.0064243   .0328959    -0.20   0.845    -.0715559    .0587073
       _cons |   4.945296   .3733601    13.25   0.000     4.206069    5.684523
------------------------------------------------------------------------------

. estimates store y1980

. local coef1980=_b[ln_hla_het]

. local lb1980 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1980 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le90 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      32.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6886
                                                Root MSE          =     .10684

------------------------------------------------------------------------------
             |               Robust
     ln_le90 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .5490235   .1798274     3.05   0.003     .1929779    .9050692
     ln_frac |   -.183742   .0828562    -2.22   0.028    -.3477915   -.0196925
   aa_ln_atd |   .0383219    .035843     1.07   0.287    -.0326448    .1092886
   ln_arable |  -.0220742   .0174598    -1.26   0.209    -.0566434    .0124949
  ln_suitavg |  -.0046492   .0148575    -0.31   0.755     -.034066    .0247677
   ln_abslat |   .0247666   .0225831     1.10   0.275    -.0199464    .0694797
      europe |   .0189598   .0440979     0.43   0.668    -.0683511    .1062706
      africa |  -.2203019   .0524047    -4.20   0.000    -.3240596   -.1165442
        asia |  -.0726899   .0444554    -1.64   0.105    -.1607085    .0153287
    americas |   .0346061   .0405436     0.85   0.395    -.0456675    .1148796
       _cons |   4.554555   .4118077    11.06   0.000     3.739204    5.369906
------------------------------------------------------------------------------

. estimates store y1990

. local coef1990=_b[ln_hla_het]

. local lb1990 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1990 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le00 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7683
                                                Root MSE          =     .09193

------------------------------------------------------------------------------
             |               Robust
     ln_le00 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .2512166   .1540813     1.63   0.106    -.0538535    .5562868
     ln_frac |  -.1775283   .0728385    -2.44   0.016    -.3217434   -.0333131
   aa_ln_atd |   .0843881   .0303567     2.78   0.006      .024284    .1444923
   ln_arable |  -.0062233   .0115616    -0.54   0.591    -.0291145    .0166679
  ln_suitavg |  -.0168243   .0100998    -1.67   0.098    -.0368211    .0031725
   ln_abslat |   .0137408   .0156327     0.88   0.381    -.0172109    .0446925
      europe |  -.0010578   .0524527    -0.02   0.984    -.1049104    .1027948
      africa |  -.2497432   .0608725    -4.10   0.000    -.3702665   -.1292199
        asia |  -.0924549    .052818    -1.75   0.083     -.197031    .0121211
    americas |   .0264391   .0515306     0.51   0.609    -.0755879     .128466
       _cons |    3.85075    .309451    12.44   0.000     3.238059    4.463442
------------------------------------------------------------------------------

. estimates store y2000

. local coef2000=_b[ln_hla_het]

. local lb2000 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub2000 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. 
. reg ln_le10 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7480
                                                Root MSE          =     .08408

------------------------------------------------------------------------------
             |               Robust
     ln_le10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .1787627   .1334796     1.34   0.183    -.0855176     .443043
     ln_frac |  -.1508934   .0700744    -2.15   0.033    -.2896359   -.0121509
   aa_ln_atd |      .0733   .0301988     2.43   0.017     .0135085    .1330916
   ln_arable |  -.0045715   .0094332    -0.48   0.629    -.0232486    .0141057
  ln_suitavg |  -.0138008   .0083383    -1.66   0.101    -.0303101    .0027084
   ln_abslat |   .0066167   .0136851     0.48   0.630    -.0204788    .0337121
      europe |   .0065547   .0508292     0.13   0.898    -.0940836     .107193
      africa |  -.2235135   .0590873    -3.78   0.000    -.3405023   -.1065247
        asia |  -.0839933   .0521013    -1.61   0.110    -.1871502    .0191637
    americas |   .0163142   .0512064     0.32   0.751    -.0850709    .1176994
       _cons |   3.912044    .282363    13.85   0.000     3.352985    4.471104
------------------------------------------------------------------------------

. estimates store y2010

. local coef2010=_b[ln_hla_het]

. local lb2010 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub2010 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. qui log off
clear

. set obs 6
number of observations (_N) was 0, now 6

. generate year = 1960 in 1
(5 missing values generated)

. replace year=1970 in 2
(1 real change made)

. replace year=1980 in 3
(1 real change made)

. replace year=1990 in 4
(1 real change made)

. replace year=2000 in 5
(1 real change made)

. replace year=2010 in 6
(1 real change made)

. 
. // Coefficients
/ is not a valid command name
r(199);

. generate coef = `coef1960' in 1
(5 missing values generated)

. replace coef=`coef1970' in 2
(1 real change made)

. replace coef=`coef1980' in 3
(1 real change made)

. replace coef=`coef1990' in 4
(1 real change made)

. replace coef=`coef2000' in 5
(1 real change made)

. replace coef=`coef2010' in 6
(1 real change made)

. 
. //lower_bound
/ is not a valid command name
r(199);

. gen lower_bound= `lb1960' in 1
(5 missing values generated)

. replace lower_bound= `lb1970' in 2
(1 real change made)

. replace lower_bound= `lb1980' in 3
(1 real change made)

. replace lower_bound= `lb1990' in 4
(1 real change made)

. replace lower_bound= `lb2000' in 5
(1 real change made)

. replace lower_bound= `lb2010' in 6
(1 real change made)

. 
. //upper_bound
/ is not a valid command name
r(199);

. gen upper_bound= `ub1960' in 1
(5 missing values generated)

. replace upper_bound= `ub1970' in 2
(1 real change made)

. replace upper_bound= `ub1980' in 3
(1 real change made)

. replace upper_bound= `ub1990' in 4
(1 real change made)

. replace upper_bound= `ub2000' in 5
(1 real change made)

. replace upper_bound= `ub2010' in 6
(1 real change made)

. qui log off
twoway (connected coef year) (line lower_bound year, lp(dash dot)) (line upper_b
> ound year, lp(dash dot)) ,  graphregion(color(white)) bgcolor(white) legend(ro
> ws(3) label(1 Point Estimate in Baseline Estimating Eq.) label(2 "95% Confiden
> ce Interval (lower bound)" ) labe(3 "95% Confidence Interval (upper bound)")) 
> xtitle("Year") ytitle("Coefficient of In HLA Heterozygosity")

. qui log off
use "hla_country_web.dta", clear

. 
. local cont "europe africa asia americas"

. local base "ln_le60!=. & ln_hla_het!=. & ln_frac!=. & ln_abslat!=. & ln_arable
> !=. & ln_suitavg!=. & aa_ln_atd!=."

. local bc "ln_frac aa_ln_atd ln_arable ln_suitavg ln_abslat"

. local pop "frac_eur frac_me frac_easia frac_africa frac_am"

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur==0, rob
note: europe omitted because of collinearity
note: americas omitted because of collinearity

Linear regression                               Number of obs     =         55
                                                F(7, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4183
                                                Root MSE          =     .12654

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .7240941   .3623023     2.00   0.052    -.0051826    1.453371
     ln_frac |  -.1662651   .1477015    -1.13   0.266    -.4635727    .1310425
   aa_ln_atd |   .0109134    .063677     0.17   0.865    -.1172619    .1390886
   ln_arable |  -.0062449   .0196735    -0.32   0.752    -.0458456    .0333558
  ln_suitavg |   .0015924   .0193779     0.08   0.935    -.0374132    .0405981
   ln_abslat |  -.0104055   .0199072    -0.52   0.604    -.0504766    .0296656
      europe |          0  (omitted)
      africa |  -.0788309    .129284    -0.61   0.545    -.3390661    .1814043
        asia |   .0581873   .1263473     0.46   0.647    -.1961366    .3125111
    americas |          0  (omitted)
       _cons |   4.663561   .7141303     6.53   0.000     3.226092    6.101031
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur>0 & frac_eur<1, rob

Linear regression                               Number of obs     =         52
                                                F(10, 41)         =      19.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5891
                                                Root MSE          =     .13973

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8048964   .2923111     2.75   0.009     .2145622    1.395231
     ln_frac |  -.1580961   .1784565    -0.89   0.381    -.5184962     .202304
   aa_ln_atd |   .1411788   .0914403     1.54   0.130    -.0434887    .3258463
   ln_arable |  -.0640976   .0343788    -1.86   0.069    -.1335269    .0053318
  ln_suitavg |   .0491992   .0384154     1.28   0.207    -.0283823    .1267806
   ln_abslat |    .053768   .0361827     1.49   0.145    -.0193045    .1268405
      europe |  -.0364848   .0463389    -0.79   0.436    -.1300682    .0570986
      africa |  -.2468748   .0834365    -2.96   0.005    -.4153782   -.0783713
        asia |  -.2803521   .0860084    -3.26   0.002    -.4540497   -.1066546
    americas |  -.1194736   .0524145    -2.28   0.028     -.225327   -.0136203
       _cons |   3.976339   .8431324     4.72   0.000     2.273599     5.67908
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur==1, rob
note: europe omitted because of collinearity
note: africa omitted because of collinearity
note: asia omitted because of collinearity
note: americas omitted because of collinearity

Linear regression                               Number of obs     =         24
                                                F(6, 17)          =       5.33
                                                Prob > F          =     0.0030
                                                R-squared         =     0.5162
                                                Root MSE          =     .04194

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    .728073   .3110997     2.34   0.032       .07171    1.384436
     ln_frac |  -.0734813   .0922997    -0.80   0.437    -.2682168    .1212541
   aa_ln_atd |   .0357073    .037792     0.94   0.358    -.0440268    .1154413
   ln_arable |  -.0090738   .0212053    -0.43   0.674    -.0538131    .0356655
  ln_suitavg |   .0184685   .0208964     0.88   0.389     -.025619     .062556
   ln_abslat |   .3230336   .1173578     2.75   0.014     .0754303     .570637
      europe |          0  (omitted)
      africa |          0  (omitted)
        asia |          0  (omitted)
    americas |          0  (omitted)
       _cons |   3.517317   .6836917     5.14   0.000     2.074853     4.95978
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `pop' `bc' `cont'  if `base', rob

Linear regression                               Number of obs     =        131
                                                F(15, 115)        =     165.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7891
                                                Root MSE          =     .11264

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8869916   .2871503     3.09   0.003     .3182021    1.455781
    frac_eur |   .3177208   .1395855     2.28   0.025     .0412289    .5942128
     frac_me |    .020621   .1596132     0.13   0.897     -.295542     .336784
  frac_easia |   .1401225   .1415624     0.99   0.324    -.1402853    .4205302
 frac_africa |   .0173643    .137623     0.13   0.900    -.2552404     .289969
     frac_am |   .1451349   .0934837     1.55   0.123    -.0400383     .330308
     ln_frac |  -.1295757   .0868859    -1.49   0.139    -.3016799    .0425285
   aa_ln_atd |   .0426266   .0416563     1.02   0.308    -.0398866    .1251398
   ln_arable |  -.0099352   .0143495    -0.69   0.490    -.0383587    .0184884
  ln_suitavg |   -.000756   .0145277    -0.05   0.959    -.0295325    .0280205
   ln_abslat |   .0068563       .018     0.38   0.704    -.0287982    .0425108
      europe |  -.0518747    .055794    -0.93   0.354    -.1623918    .0586425
      africa |  -.1408858   .0945556    -1.49   0.139    -.3281822    .0464106
        asia |  -.0978798   .0933299    -1.05   0.296    -.2827483    .0869887
    americas |   -.057943   .0612781    -0.95   0.346    -.1793231    .0634371
       _cons |   4.598251   .4873273     9.44   0.000     3.632949    5.563552
------------------------------------------------------------------------------

. qui log off
local ov1 "aa_pdiv!=. & malfal!=.  & tropical!=. & pnativ_60!=. & distcr100!=. "

. 
. reg ln_le60 ln_hla_het aa_pdiv `bc' `cont' if `ov1', rob

Linear regression                               Number of obs     =        131
                                                F(11, 119)        =      90.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7449
                                                Root MSE          =     .12179

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   1.077102    .340135     3.17   0.002     .4036012    1.750604
     aa_pdiv |  -.2783647   1.199801    -0.23   0.817    -2.654091    2.097362
     ln_frac |   -.113391   .1067678    -1.06   0.290    -.3248019    .0980199
   aa_ln_atd |   .0406652   .0470243     0.86   0.389    -.0524476    .1337779
   ln_arable |  -.0083386   .0157507    -0.53   0.598    -.0395265    .0228493
  ln_suitavg |    .007875   .0127592     0.62   0.538    -.0173895    .0331395
   ln_abslat |   .0206019   .0161684     1.27   0.205    -.0114131    .0526169
      europe |   .0390449   .0703013     0.56   0.580    -.1001588    .1782486
      africa |  -.3031556   .0870473    -3.48   0.001    -.4755179   -.1307932
        asia |  -.2058545   .0739893    -2.78   0.006    -.3523608   -.0593482
    americas |   -.045389   .0776443    -0.58   0.560    -.1991325    .1083545
       _cons |    5.19642   1.000954     5.19   0.000     3.214432    7.178408
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het malfal tropical desert distcr100 `bc' `cont' if `ov1', 
> rob

Linear regression                               Number of obs     =        131
                                                F(14, 116)        =      78.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7741
                                                Root MSE          =     .11606

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .7713477   .2040145     3.78   0.000     .3672712    1.175424
      malfal |  -.1613359   .0481473    -3.35   0.001    -.2566976   -.0659741
    tropical |  -.0003105   .0005798    -0.54   0.593    -.0014589     .000838
      desert |  -.0015805   .0015453    -1.02   0.309    -.0046411    .0014802
  distcr1000 |    .011631   .0384694     0.30   0.763    -.0645626    .0878246
     ln_frac |  -.0863313   .0921872    -0.94   0.351    -.2689197     .096257
   aa_ln_atd |   .0120531   .0330839     0.36   0.716    -.0534738      .07758
   ln_arable |  -.0019372   .0127372    -0.15   0.879    -.0271649    .0232905
  ln_suitavg |   .0037507    .012647     0.30   0.767    -.0212982    .0287996
   ln_abslat |  -.0149382   .0184394    -0.81   0.420    -.0514598    .0215834
      europe |   .0444248   .0730941     0.61   0.545    -.1003473    .1891969
      africa |  -.2552539   .0778437    -3.28   0.001    -.4094332   -.1010745
        asia |  -.1849297   .0777094    -2.38   0.019    -.3388429   -.0310165
    americas |  -.0619446   .0777163    -0.80   0.427    -.2158716    .0919824
       _cons |   5.007553    .388945    12.87   0.000     4.237198    5.777907
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het frac_migrant `bc' `cont' if `ov1', rob

Linear regression                               Number of obs     =        131
                                                F(11, 119)        =      85.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7504
                                                Root MSE          =     .12047

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8699479    .223888     3.89   0.000     .4266273    1.313268
frac_migrant |   .0982091   .0632069     1.55   0.123    -.0269468    .2233651
     ln_frac |  -.1440908   .0987111    -1.46   0.147    -.3395486     .051367
   aa_ln_atd |    .041594   .0395006     1.05   0.294    -.0366212    .1198093
   ln_arable |  -.0085389   .0155162    -0.55   0.583    -.0392626    .0221847
  ln_suitavg |   .0113689   .0119537     0.95   0.343    -.0123006    .0350383
   ln_abslat |   .0157883    .016349     0.97   0.336    -.0165843     .048161
      europe |   .1133226   .0846705     1.34   0.183    -.0543335    .2809787
      africa |    -.25279   .0810031    -3.12   0.002    -.4131842   -.0923958
        asia |   -.147021   .0801837    -1.83   0.069    -.3057927    .0117507
    americas |  -.0426537   .0676053    -0.63   0.529     -.176519    .0912116
       _cons |   4.708444   .4388107    10.73   0.000     3.839555    5.577333
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het aa_pdiv malfal tropical desert distcr100 frac_migrant `
> bc' `cont' if `ov1', rob

Linear regression                               Number of obs     =        131
                                                F(16, 114)        =      64.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7824
                                                Root MSE          =     .11491

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .5372995   .3093499     1.74   0.085    -.0755202    1.150119
     aa_pdiv |    .138512   1.028011     0.13   0.893     -1.89797    2.174994
      malfal |  -.1730445   .0487015    -3.55   0.001    -.2695218   -.0765672
    tropical |  -.0002674   .0005692    -0.47   0.639    -.0013949    .0008601
      desert |  -.0012792   .0014481    -0.88   0.379    -.0041478    .0015894
  distcr1000 |   .0299095   .0381407     0.78   0.435    -.0456469     .105466
frac_migrant |   .1203078   .0733916     1.64   0.104    -.0250803    .2656959
     ln_frac |  -.1187416   .1035394    -1.15   0.254    -.3238522    .0863691
   aa_ln_atd |   .0120886   .0375722     0.32   0.748    -.0623416    .0865188
   ln_arable |  -.0020202   .0121886    -0.17   0.869    -.0261657    .0221252
  ln_suitavg |   .0097049   .0121508     0.80   0.426    -.0143658    .0337755
   ln_abslat |   -.021768    .019187    -1.13   0.259    -.0597774    .0162413
      europe |   .1426791   .0957523     1.49   0.139    -.0470055    .3323637
      africa |  -.1868511   .1054909    -1.77   0.079    -.3958278    .0221256
        asia |  -.1124693   .0903735    -1.24   0.216    -.2914986    .0665599
    americas |  -.0646517   .0742432    -0.87   0.386    -.2117268    .0824234
       _cons |   4.584323    .881409     5.20   0.000     2.838259    6.330388
------------------------------------------------------------------------------

. qui log off
local ov2 "ln_ypc60!=. & ln_yr_sch1960!=. & ln_pd60!=. & ln_urb60!=. & ln_young!
> =."

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(10, 98)         =      81.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7378
                                                Root MSE          =     .11998

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .9999595   .2118165     4.72   0.000     .5796165    1.420302
     ln_frac |  -.0687966   .1026132    -0.67   0.504    -.2724292     .134836
   aa_ln_atd |   .0220791   .0427207     0.52   0.606    -.0626988     .106857
   ln_arable |  -.0203005   .0163016    -1.25   0.216    -.0526505    .0120494
  ln_suitavg |   .0070124   .0139013     0.50   0.615    -.0205742     .034599
   ln_abslat |   .0169459   .0166373     1.02   0.311    -.0160703     .049962
      europe |   .0821774   .0783703     1.05   0.297    -.0733459    .2377008
      africa |  -.3038598    .085273    -3.56   0.001    -.4730812   -.1346384
        asia |  -.1987743   .0862051    -2.31   0.023    -.3698456    -.027703
    americas |  -.0337169    .083025    -0.41   0.686    -.1984773    .1310434
       _cons |   5.075976   .4274974    11.87   0.000     4.227622    5.924331
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_ypc60 `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(11, 97)         =      78.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8062
                                                Root MSE          =     .10368

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .6574856   .2123752     3.10   0.003     .2359796    1.078992
    ln_ypc60 |   .0977108   .0220749     4.43   0.000     .0538981    .1415234
     ln_frac |  -.1265308   .0889372    -1.42   0.158    -.3030465    .0499848
   aa_ln_atd |  -.0006487   .0401033    -0.02   0.987    -.0802427    .0789453
   ln_arable |  -.0105789   .0161119    -0.66   0.513    -.0425566    .0213989
  ln_suitavg |   .0290353     .01418     2.05   0.043      .000892    .0571787
   ln_abslat |   .0089705   .0178069     0.50   0.616    -.0263713    .0443123
      europe |   .0967318   .0609128     1.59   0.116    -.0241633    .2176268
      africa |  -.1342939   .0807126    -1.66   0.099    -.2944862    .0258983
        asia |  -.0661328   .0708522    -0.93   0.353    -.2067548    .0744893
    americas |   .0155833   .0634731     0.25   0.807    -.1103931    .1415598
       _cons |     4.0475   .4733963     8.55   0.000     3.107939    4.987061
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_yr_sch1960 `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(11, 97)         =     108.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8727
                                                Root MSE          =     .08403

-------------------------------------------------------------------------------
              |               Robust
      ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ln_hla_het |   .6127261   .1633457     3.75   0.000       .28853    .9369221
ln_yr_sch1960 |   .1320134    .019477     6.78   0.000     .0933569    .1706699
      ln_frac |  -.0241461   .0610461    -0.40   0.693    -.1453058    .0970136
    aa_ln_atd |    .071103   .0282958     2.51   0.014     .0149436    .1272624
    ln_arable |   .0043996   .0115413     0.38   0.704    -.0185067     .027306
   ln_suitavg |  -.0081406   .0108674    -0.75   0.456    -.0297093    .0134282
    ln_abslat |   .0059583   .0124948     0.48   0.635    -.0188404     .030757
       europe |   .0285669   .0269261     1.06   0.291    -.0248739    .0820078
       africa |  -.1239058   .0453816    -2.73   0.008    -.2139757   -.0338358
         asia |  -.1525689   .0349806    -4.36   0.000    -.2219957    -.083142
     americas |  -.0317955   .0268294    -1.19   0.239    -.0850445    .0214535
        _cons |    3.99027   .3344223    11.93   0.000     3.326535    4.654006
-------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_pd60 ln_urb60 ln_young `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(13, 95)         =      58.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8256
                                                Root MSE          =     .09939

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .7528768   .1943835     3.87   0.000     .3669768    1.138777
     ln_pd60 |   .0001866   .0151894     0.01   0.990    -.0299681    .0303414
    ln_urb60 |   .1137048   .0222823     5.10   0.000     .0694688    .1579408
    ln_young |  -.0614236   .0886641    -0.69   0.490    -.2374441    .1145969
     ln_frac |  -.1367887   .0831761    -1.64   0.103    -.3019141    .0283367
   aa_ln_atd |   -.075599   .0396077    -1.91   0.059    -.1542302    .0030322
   ln_arable |  -.0064507   .0170226    -0.38   0.706    -.0402447    .0273434
  ln_suitavg |   .0133635   .0119674     1.12   0.267    -.0103947    .0371218
   ln_abslat |   -.009797   .0191409    -0.51   0.610    -.0477966    .0282025
      europe |   .0512724    .052395     0.98   0.330    -.0527449    .1552897
      africa |  -.2301635   .0573917    -4.01   0.000    -.3441005   -.1162265
        asia |  -.1139926   .0547566    -2.08   0.040    -.2226982   -.0052871
    americas |  -.0694854   .0447219    -1.55   0.124    -.1582697    .0192989
       _cons |   5.523092   .5104961    10.82   0.000     4.509629    6.536555
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_ypc60 ln_yr_sch1960 ln_pd60 ln_urb60 ln_young `bc' `
> cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(15, 93)         =      88.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8897
                                                Root MSE          =     .07987

-------------------------------------------------------------------------------
              |               Robust
      ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ln_hla_het |    .529581   .1672842     3.17   0.002     .1973878    .8617742
     ln_ypc60 |   .0280348    .016719     1.68   0.097    -.0051658    .0612354
ln_yr_sch1960 |   .1036748   .0189568     5.47   0.000     .0660303    .1413194
      ln_pd60 |   .0062813   .0126177     0.50   0.620    -.0187749    .0313375
     ln_urb60 |   .0342884   .0194949     1.76   0.082    -.0044246    .0730014
     ln_young |  -.0148322   .0685018    -0.22   0.829    -.1508632    .1211988
      ln_frac |  -.0582462   .0703963    -0.83   0.410    -.1980392    .0815469
    aa_ln_atd |    .024198   .0292272     0.83   0.410    -.0338415    .0822375
    ln_arable |   .0014524   .0146563     0.10   0.921    -.0276522     .030557
   ln_suitavg |   .0023245   .0111488     0.21   0.835    -.0198147    .0244637
    ln_abslat |  -.0001829   .0152382    -0.01   0.990     -.030443    .0300772
       europe |   .0255092   .0397006     0.64   0.522    -.0533284    .1043467
       africa |  -.0977018   .0504283    -1.94   0.056    -.1978425    .0024388
         asia |  -.1094775   .0438173    -2.50   0.014    -.1964899    -.022465
     americas |  -.0341979   .0351158    -0.97   0.333     -.103931    .0355352
        _cons |   4.048212   .4632424     8.74   0.000     3.128304    4.968119
-------------------------------------------------------------------------------

. qui log off
local ov2 "ln_ypc60!=. & ln_yr_sch1960!=. & ln_pd60!=. & ln_urb60!=. & ln_young!
> =."

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(10, 98)         =      81.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7378
                                                Root MSE          =     .11998

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .9999595   .2118165     4.72   0.000     .5796165    1.420302
     ln_frac |  -.0687966   .1026132    -0.67   0.504    -.2724292     .134836
   aa_ln_atd |   .0220791   .0427207     0.52   0.606    -.0626988     .106857
   ln_arable |  -.0203005   .0163016    -1.25   0.216    -.0526505    .0120494
  ln_suitavg |   .0070124   .0139013     0.50   0.615    -.0205742     .034599
   ln_abslat |   .0169459   .0166373     1.02   0.311    -.0160703     .049962
      europe |   .0821774   .0783703     1.05   0.297    -.0733459    .2377008
      africa |  -.3038598    .085273    -3.56   0.001    -.4730812   -.1346384
        asia |  -.1987743   .0862051    -2.31   0.023    -.3698456    -.027703
    americas |  -.0337169    .083025    -0.41   0.686    -.1984773    .1310434
       _cons |   5.075976   .4274974    11.87   0.000     4.227622    5.924331
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_ypc60 `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(11, 97)         =      78.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8062
                                                Root MSE          =     .10368

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .6574856   .2123752     3.10   0.003     .2359796    1.078992
    ln_ypc60 |   .0977108   .0220749     4.43   0.000     .0538981    .1415234
     ln_frac |  -.1265308   .0889372    -1.42   0.158    -.3030465    .0499848
   aa_ln_atd |  -.0006487   .0401033    -0.02   0.987    -.0802427    .0789453
   ln_arable |  -.0105789   .0161119    -0.66   0.513    -.0425566    .0213989
  ln_suitavg |   .0290353     .01418     2.05   0.043      .000892    .0571787
   ln_abslat |   .0089705   .0178069     0.50   0.616    -.0263713    .0443123
      europe |   .0967318   .0609128     1.59   0.116    -.0241633    .2176268
      africa |  -.1342939   .0807126    -1.66   0.099    -.2944862    .0258983
        asia |  -.0661328   .0708522    -0.93   0.353    -.2067548    .0744893
    americas |   .0155833   .0634731     0.25   0.807    -.1103931    .1415598
       _cons |     4.0475   .4733963     8.55   0.000     3.107939    4.987061
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_yr_sch1960 `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(11, 97)         =     108.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8727
                                                Root MSE          =     .08403

-------------------------------------------------------------------------------
              |               Robust
      ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ln_hla_het |   .6127261   .1633457     3.75   0.000       .28853    .9369221
ln_yr_sch1960 |   .1320134    .019477     6.78   0.000     .0933569    .1706699
      ln_frac |  -.0241461   .0610461    -0.40   0.693    -.1453058    .0970136
    aa_ln_atd |    .071103   .0282958     2.51   0.014     .0149436    .1272624
    ln_arable |   .0043996   .0115413     0.38   0.704    -.0185067     .027306
   ln_suitavg |  -.0081406   .0108674    -0.75   0.456    -.0297093    .0134282
    ln_abslat |   .0059583   .0124948     0.48   0.635    -.0188404     .030757
       europe |   .0285669   .0269261     1.06   0.291    -.0248739    .0820078
       africa |  -.1239058   .0453816    -2.73   0.008    -.2139757   -.0338358
         asia |  -.1525689   .0349806    -4.36   0.000    -.2219957    -.083142
     americas |  -.0317955   .0268294    -1.19   0.239    -.0850445    .0214535
        _cons |    3.99027   .3344223    11.93   0.000     3.326535    4.654006
-------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_pd60 ln_urb60 ln_young `bc' `cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(13, 95)         =      58.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8256
                                                Root MSE          =     .09939

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .7528768   .1943835     3.87   0.000     .3669768    1.138777
     ln_pd60 |   .0001866   .0151894     0.01   0.990    -.0299681    .0303414
    ln_urb60 |   .1137048   .0222823     5.10   0.000     .0694688    .1579408
    ln_young |  -.0614236   .0886641    -0.69   0.490    -.2374441    .1145969
     ln_frac |  -.1367887   .0831761    -1.64   0.103    -.3019141    .0283367
   aa_ln_atd |   -.075599   .0396077    -1.91   0.059    -.1542302    .0030322
   ln_arable |  -.0064507   .0170226    -0.38   0.706    -.0402447    .0273434
  ln_suitavg |   .0133635   .0119674     1.12   0.267    -.0103947    .0371218
   ln_abslat |   -.009797   .0191409    -0.51   0.610    -.0477966    .0282025
      europe |   .0512724    .052395     0.98   0.330    -.0527449    .1552897
      africa |  -.2301635   .0573917    -4.01   0.000    -.3441005   -.1162265
        asia |  -.1139926   .0547566    -2.08   0.040    -.2226982   -.0052871
    americas |  -.0694854   .0447219    -1.55   0.124    -.1582697    .0192989
       _cons |   5.523092   .5104961    10.82   0.000     4.509629    6.536555
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het ln_ypc60 ln_yr_sch1960 ln_pd60 ln_urb60 ln_young `bc' `
> cont' if `ov2', rob

Linear regression                               Number of obs     =        109
                                                F(15, 93)         =      88.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8897
                                                Root MSE          =     .07987

-------------------------------------------------------------------------------
              |               Robust
      ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
   ln_hla_het |    .529581   .1672842     3.17   0.002     .1973878    .8617742
     ln_ypc60 |   .0280348    .016719     1.68   0.097    -.0051658    .0612354
ln_yr_sch1960 |   .1036748   .0189568     5.47   0.000     .0660303    .1413194
      ln_pd60 |   .0062813   .0126177     0.50   0.620    -.0187749    .0313375
     ln_urb60 |   .0342884   .0194949     1.76   0.082    -.0044246    .0730014
     ln_young |  -.0148322   .0685018    -0.22   0.829    -.1508632    .1211988
      ln_frac |  -.0582462   .0703963    -0.83   0.410    -.1980392    .0815469
    aa_ln_atd |    .024198   .0292272     0.83   0.410    -.0338415    .0822375
    ln_arable |   .0014524   .0146563     0.10   0.921    -.0276522     .030557
   ln_suitavg |   .0023245   .0111488     0.21   0.835    -.0198147    .0244637
    ln_abslat |  -.0001829   .0152382    -0.01   0.990     -.030443    .0300772
       europe |   .0255092   .0397006     0.64   0.522    -.0533284    .1043467
       africa |  -.0977018   .0504283    -1.94   0.056    -.1978425    .0024388
         asia |  -.1094775   .0438173    -2.50   0.014    -.1964899    -.022465
     americas |  -.0341979   .0351158    -0.97   0.333     -.103931    .0355352
        _cons |   4.048212   .4632424     8.74   0.000     3.128304    4.968119
-------------------------------------------------------------------------------

. qui log off
clear

. use "hla_country_web.dta", clear

. 
. local cont "europe africa asia americas"

. local base "ln_le60!=. & ln_hla_het!=. & ln_frac!=. & ln_abslat!=. & ln_arable
> !=. & ln_suitavg!=. & aa_ln_atd!=."

. local bc "ln_frac aa_ln_atd ln_arable ln_suitavg ln_abslat"

. local pop "frac_eur frac_me frac_easia frac_africa frac_am"

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur==0, rob
note: europe omitted because of collinearity
note: americas omitted because of collinearity

Linear regression                               Number of obs     =         55
                                                F(7, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4183
                                                Root MSE          =     .12654

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .7240941   .3623023     2.00   0.052    -.0051826    1.453371
     ln_frac |  -.1662651   .1477015    -1.13   0.266    -.4635727    .1310425
   aa_ln_atd |   .0109134    .063677     0.17   0.865    -.1172619    .1390886
   ln_arable |  -.0062449   .0196735    -0.32   0.752    -.0458456    .0333558
  ln_suitavg |   .0015924   .0193779     0.08   0.935    -.0374132    .0405981
   ln_abslat |  -.0104055   .0199072    -0.52   0.604    -.0504766    .0296656
      europe |          0  (omitted)
      africa |  -.0788309    .129284    -0.61   0.545    -.3390661    .1814043
        asia |   .0581873   .1263473     0.46   0.647    -.1961366    .3125111
    americas |          0  (omitted)
       _cons |   4.663561   .7141303     6.53   0.000     3.226092    6.101031
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur>0 & frac_eur<1, rob

Linear regression                               Number of obs     =         52
                                                F(10, 41)         =      19.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5891
                                                Root MSE          =     .13973

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8048964   .2923111     2.75   0.009     .2145622    1.395231
     ln_frac |  -.1580961   .1784565    -0.89   0.381    -.5184962     .202304
   aa_ln_atd |   .1411788   .0914403     1.54   0.130    -.0434887    .3258463
   ln_arable |  -.0640976   .0343788    -1.86   0.069    -.1335269    .0053318
  ln_suitavg |   .0491992   .0384154     1.28   0.207    -.0283823    .1267806
   ln_abslat |    .053768   .0361827     1.49   0.145    -.0193045    .1268405
      europe |  -.0364848   .0463389    -0.79   0.436    -.1300682    .0570986
      africa |  -.2468748   .0834365    -2.96   0.005    -.4153782   -.0783713
        asia |  -.2803521   .0860084    -3.26   0.002    -.4540497   -.1066546
    americas |  -.1194736   .0524145    -2.28   0.028     -.225327   -.0136203
       _cons |   3.976339   .8431324     4.72   0.000     2.273599     5.67908
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `base' & frac_eur==1, rob
note: europe omitted because of collinearity
note: africa omitted because of collinearity
note: asia omitted because of collinearity
note: americas omitted because of collinearity

Linear regression                               Number of obs     =         24
                                                F(6, 17)          =       5.33
                                                Prob > F          =     0.0030
                                                R-squared         =     0.5162
                                                Root MSE          =     .04194

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    .728073   .3110997     2.34   0.032       .07171    1.384436
     ln_frac |  -.0734813   .0922997    -0.80   0.437    -.2682168    .1212541
   aa_ln_atd |   .0357073    .037792     0.94   0.358    -.0440268    .1154413
   ln_arable |  -.0090738   .0212053    -0.43   0.674    -.0538131    .0356655
  ln_suitavg |   .0184685   .0208964     0.88   0.389     -.025619     .062556
   ln_abslat |   .3230336   .1173578     2.75   0.014     .0754303     .570637
      europe |          0  (omitted)
      africa |          0  (omitted)
        asia |          0  (omitted)
    americas |          0  (omitted)
       _cons |   3.517317   .6836917     5.14   0.000     2.074853     4.95978
------------------------------------------------------------------------------

. 
. reg ln_le60 ln_hla_het `pop' `bc' `cont'  if `base', rob

Linear regression                               Number of obs     =        131
                                                F(15, 115)        =     165.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7891
                                                Root MSE          =     .11264

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8869916   .2871503     3.09   0.003     .3182021    1.455781
    frac_eur |   .3177208   .1395855     2.28   0.025     .0412289    .5942128
     frac_me |    .020621   .1596132     0.13   0.897     -.295542     .336784
  frac_easia |   .1401225   .1415624     0.99   0.324    -.1402853    .4205302
 frac_africa |   .0173643    .137623     0.13   0.900    -.2552404     .289969
     frac_am |   .1451349   .0934837     1.55   0.123    -.0400383     .330308
     ln_frac |  -.1295757   .0868859    -1.49   0.139    -.3016799    .0425285
   aa_ln_atd |   .0426266   .0416563     1.02   0.308    -.0398866    .1251398
   ln_arable |  -.0099352   .0143495    -0.69   0.490    -.0383587    .0184884
  ln_suitavg |   -.000756   .0145277    -0.05   0.959    -.0295325    .0280205
   ln_abslat |   .0068563       .018     0.38   0.704    -.0287982    .0425108
      europe |  -.0518747    .055794    -0.93   0.354    -.1623918    .0586425
      africa |  -.1408858   .0945556    -1.49   0.139    -.3281822    .0464106
        asia |  -.0978798   .0933299    -1.05   0.296    -.2827483    .0869887
    americas |   -.057943   .0612781    -0.95   0.346    -.1793231    .0634371
       _cons |   4.598251   .4873273     9.44   0.000     3.632949    5.563552
------------------------------------------------------------------------------

. qui log off
/* local le "ln_le60!=. & ln_le70!=. & ln_le80!=. & ln_le90!=. & ln_le00!=. & ln
> _le10!=."
/ is not a valid command name
r(199);

. 
. reg ln_le60 ln_hla_het `bc' `cont' if `le', rob 

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =     100.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7446
                                                Root MSE          =     .12133

------------------------------------------------------------------------------
             |               Robust
     ln_le60 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.01512   .1899264     5.34   0.000     .6390794    1.391161
     ln_frac |  -.1210012   .0927409    -1.30   0.194    -.3046217    .0626193
   aa_ln_atd |   .0369984   .0397486     0.93   0.354    -.0417011    .1156979
   ln_arable |  -.0086997   .0159756    -0.54   0.587    -.0403303    .0229309
  ln_suitavg |    .008039   .0128307     0.63   0.532     -.017365    .0334429
   ln_abslat |   .0199086   .0156461     1.27   0.206    -.0110696    .0508867
      europe |   .0387395   .0716524     0.54   0.590    -.1031272    .1806062
      africa |  -.3122101   .0754901    -4.14   0.000    -.4616753    -.162745
        asia |  -.2056222   .0755278    -2.72   0.007     -.355162   -.0560825
    americas |  -.0400593   .0736294    -0.54   0.587    -.1858403    .1057217
       _cons |   4.962063   .4156831    11.94   0.000     4.139039    5.785086
------------------------------------------------------------------------------

. estimates store y1960

. local coef1960=_b[ln_hla_het]

. local lb1960 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1960 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le70 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      76.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7340
                                                Root MSE          =     .11485

------------------------------------------------------------------------------
             |               Robust
     ln_le70 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |    1.04047   .1695943     6.14   0.000     .7046852    1.376255
     ln_frac |  -.1163928   .0881347    -1.32   0.189    -.2908934    .0581078
   aa_ln_atd |   .0246249   .0372331     0.66   0.510    -.0490941     .098344
   ln_arable |  -.0141638   .0153671    -0.92   0.359    -.0445896    .0162619
  ln_suitavg |   .0007926   .0135757     0.06   0.954    -.0260864    .0276715
   ln_abslat |   .0045722   .0158262     0.29   0.773    -.0267626    .0359069
      europe |   .0344497   .0460362     0.75   0.456    -.0566989    .1255982
      africa |  -.3192781   .0522129    -6.11   0.000    -.4226561   -.2159002
        asia |  -.1420921   .0484679    -2.93   0.004    -.2380552    -.046129
    americas |  -.0238244   .0420173    -0.57   0.572    -.1070157    .0593668
       _cons |   5.198611   .3846817    13.51   0.000     4.436968    5.960254
------------------------------------------------------------------------------

. estimates store y1970

. local coef1970=_b[ln_hla_het]

. local lb1970 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1970 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le80 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      55.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6995
                                                Root MSE          =     .10588

------------------------------------------------------------------------------
             |               Robust
     ln_le80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .8420929    .169953     4.95   0.000     .5055977    1.178588
     ln_frac |  -.1462667   .0786894    -1.86   0.066    -.3020663    .0095329
   aa_ln_atd |   .0348747   .0381473     0.91   0.362    -.0406544    .1104037
   ln_arable |  -.0199753   .0150991    -1.32   0.188    -.0498705    .0099199
  ln_suitavg |   .0003745   .0142482     0.03   0.979    -.0278359    .0285849
   ln_abslat |   .0070102   .0152294     0.46   0.646    -.0231431    .0371634
      europe |   .0176881   .0373365     0.47   0.637    -.0562357    .0916118
      africa |  -.2552229   .0450962    -5.66   0.000    -.3445103   -.1659355
        asia |  -.1194574   .0422942    -2.82   0.006     -.203197   -.0357178
    americas |  -.0064243   .0328959    -0.20   0.845    -.0715559    .0587073
       _cons |   4.945296   .3733601    13.25   0.000     4.206069    5.684523
------------------------------------------------------------------------------

. estimates store y1980

. local coef1980=_b[ln_hla_het]

. local lb1980 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1980 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le90 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      32.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6886
                                                Root MSE          =     .10684

------------------------------------------------------------------------------
             |               Robust
     ln_le90 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .5490235   .1798274     3.05   0.003     .1929779    .9050692
     ln_frac |   -.183742   .0828562    -2.22   0.028    -.3477915   -.0196925
   aa_ln_atd |   .0383219    .035843     1.07   0.287    -.0326448    .1092886
   ln_arable |  -.0220742   .0174598    -1.26   0.209    -.0566434    .0124949
  ln_suitavg |  -.0046492   .0148575    -0.31   0.755     -.034066    .0247677
   ln_abslat |   .0247666   .0225831     1.10   0.275    -.0199464    .0694797
      europe |   .0189598   .0440979     0.43   0.668    -.0683511    .1062706
      africa |  -.2203019   .0524047    -4.20   0.000    -.3240596   -.1165442
        asia |  -.0726899   .0444554    -1.64   0.105    -.1607085    .0153287
    americas |   .0346061   .0405436     0.85   0.395    -.0456675    .1148796
       _cons |   4.554555   .4118077    11.06   0.000     3.739204    5.369906
------------------------------------------------------------------------------

. estimates store y1990

. local coef1990=_b[ln_hla_het]

. local lb1990 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub1990 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. reg ln_le00 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7683
                                                Root MSE          =     .09193

------------------------------------------------------------------------------
             |               Robust
     ln_le00 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .2512166   .1540813     1.63   0.106    -.0538535    .5562868
     ln_frac |  -.1775283   .0728385    -2.44   0.016    -.3217434   -.0333131
   aa_ln_atd |   .0843881   .0303567     2.78   0.006      .024284    .1444923
   ln_arable |  -.0062233   .0115616    -0.54   0.591    -.0291145    .0166679
  ln_suitavg |  -.0168243   .0100998    -1.67   0.098    -.0368211    .0031725
   ln_abslat |   .0137408   .0156327     0.88   0.381    -.0172109    .0446925
      europe |  -.0010578   .0524527    -0.02   0.984    -.1049104    .1027948
      africa |  -.2497432   .0608725    -4.10   0.000    -.3702665   -.1292199
        asia |  -.0924549    .052818    -1.75   0.083     -.197031    .0121211
    americas |   .0264391   .0515306     0.51   0.609    -.0755879     .128466
       _cons |    3.85075    .309451    12.44   0.000     3.238059    4.463442
------------------------------------------------------------------------------

. estimates store y2000

. local coef2000=_b[ln_hla_het]

. local lb2000 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub2000 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. 
. 
. reg ln_le10 ln_hla_het `bc' `cont' if `le', rob

Linear regression                               Number of obs     =        131
                                                F(10, 120)        =      43.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7480
                                                Root MSE          =     .08408

------------------------------------------------------------------------------
             |               Robust
     ln_le10 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  ln_hla_het |   .1787627   .1334796     1.34   0.183    -.0855176     .443043
     ln_frac |  -.1508934   .0700744    -2.15   0.033    -.2896359   -.0121509
   aa_ln_atd |      .0733   .0301988     2.43   0.017     .0135085    .1330916
   ln_arable |  -.0045715   .0094332    -0.48   0.629    -.0232486    .0141057
  ln_suitavg |  -.0138008   .0083383    -1.66   0.101    -.0303101    .0027084
   ln_abslat |   .0066167   .0136851     0.48   0.630    -.0204788    .0337121
      europe |   .0065547   .0508292     0.13   0.898    -.0940836     .107193
      africa |  -.2235135   .0590873    -3.78   0.000    -.3405023   -.1065247
        asia |  -.0839933   .0521013    -1.61   0.110    -.1871502    .0191637
    americas |   .0163142   .0512064     0.32   0.751    -.0850709    .1176994
       _cons |   3.912044    .282363    13.85   0.000     3.352985    4.471104
------------------------------------------------------------------------------

. estimates store y2010

. local coef2010=_b[ln_hla_het]

. local lb2010 = _b[ln_hla_het] - invttail(e(df_r),0.025)*_se[ln_hla_het]

. local ub2010 = _b[ln_hla_het] + invttail(e(df_r),0.025)*_se[ln_hla_het]

. qui log off
